## Add a Test

TDD에서 새로운 Feature는 Test Case 작성으로 부터 시작한다. 
Test Case는 새로운 기능에 대한 간결하게 정의 되어 있어야하며, 개발자가 이것을 통해 요구사항에 대해 파악 할 수 있도록 작성한다.

## Run all Tests and See if the new Test fails

이전에 작성되어 있던 테스트를 실행하고 현재 소프트웨어가 정상적으로 작동함을 검증한다. 이후 새롭게 작성된 테스트를 붙이고 개발 또는 향상시키고자 하는 기능의 테스트가 Fail이 나는 것을 확인한다.

## Write the Code

해당 기능의 코드를 작성한다. 이 과정에서 코드의 완벽함 보다는 기능의 동작을 추구한다.
개발자가 코드를 작성할 때, 테스트에 대해 기능적으로 만족시키는 코드 이외의 것은 신경쓰지 않는다. 

## Run Tests

다시 테스트를 실행한다. 작성된 테스트가 만족할 때 까지 코드를 수정하고 디버깅을 한다.

## Refactor Code

작성된 테스트를 기능적으로 만족시켰다면 해당 코드를 리팩토링한다. TDD는 개발자가 리팩토링을 마친후 테스트 검증을 통해 해당 리팩토링이 소프트웨어 기능에 영향을 주지 않은 것을 확인 시켜줄 수 있다.
리팩토링 과정에서 테스트의 실패가 일어났다면 테스트가 정상적으로 작동했던 과정으로 회귀 한 뒤 실패 Case를 새로 작성한다.

## Repeat

위의 5가지 과정을 새로운 기능 추가 또는 향상에 대해 반복적으로 시행된다.
